{
  "data": [
    {
      "heading": "Developer",
      "text": "Full Stack Developer with 7 years experience writing React Native apps for ios and android and React apps for web.\nIndustry experience in the software development lifecycle (SDLC) in development, decision-making, leading, testing, deploying, bug fixing, and designing user experiences.\nProfessional writer of React Native, React, Typescript, JavaScript, Redux, Realm, HTML5, CSS, PHP; using tools such as Jira, Git, Bitbucket, Trello; and following methodologies such as Agile and SCRUM.\nExperience mentoring less-experienced devs, leading on smaller projects, maintaining legacy systems, decision making of code trajectory, reviewing code to ensure high quality, estimating effort/time required for tasks, supporting non-developer team members such as Product Owners, Scrum Masters, UX/UI Designers.\nExcellent analytical and logical programming skills with a good understanding at the conceptual level."
    },
    {
      "heading": "Work Experience",
      "text": "January 2024 - Current\nDeveloper \nMayden, Bath, UK\nReact.JS and PHP development of new features and information security fixes. Maintenance of legacy systems and implementation of new features. Mentoring devs. Leading on sub-projects. Decision making on trajectory of the frontend codebases.\n\nApril 2020 - December 2023\nDeveloper\nLivingWith, Bath, UK\nFixed bugs and added new features to react-native TS apps. Maintained a high quality code base by following coding standards and kept in mind the flexibility required for improvements in the future. Reviewed and tested code and added unit tests to reduce the likelihood of future bugs.\n\nJuly 2018 - April 2020 \nSoftware Engineer \nLivingMap, Bath, UK\nDeveloped front-end and UI across multiple map products across mobile and desktop platforms. Lead feature development of the Map Management System being delivered by multiple engineers. Development of applications using TypeScript, JavaScript, CSS, React.\n"
    },
    {
      "heading": "Contact",
      "text": "07432682616\ndorisaward@gmail.com\n3 Whitemore Court,\nBatheaston,\nBath, BA1 7PD\ndorisward.uk\nReferences available on request\n"
    },
    {
      "heading": "Education",
      "text": "2013 - 2014\nPGCE: Secondary Mathematics\nKeele University\n\n2010 - 2013\nBSc(Hons) Computer Science &\nBSc(Hons) Mathematics Dual Hons\nKeele University\n\n2008 - 2010\n5x A-Levels (B-C Grade)\nJohn Taylor Sixth Form \n\n2003 - 2008\n10x GSCEs(A* - A)\nJohn Taylor High School\n"
    }
  ]
}